# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -100 до 100.
my_list=[-20,40,55,10,-6,4,50, -100]
sum=0
for el in my_list:
    if el>0 and el%2==0:
        sum=sum+el
print(sum)

# Вывести на экран сумму всех положительных элементов кратных двум.

# TODO: your code here
